src/InformationRegisters/ПравилаSLA.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПравилаSLA</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокРеакцииЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокРешенияЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияИзмененияСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияСтатусов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтарыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НарушенияSLA.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НарушенияSLA</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНарушения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНарушения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНарушенийSLA</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Решена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНарушенийSLA.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНарушенийSLA</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НарушениеСрокаРеакции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеСрокаРешения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаУточнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеСрокаРеакции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеСрокаРешения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеSLA</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетЗакрытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяРаботаСОборудованием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаСОборудованиемЗавершена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ITЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ITЗаявка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/УправлениеSLAСервер/Ext/Module.bsl
Функция ПолучитьПравилоSLA(Приоритет, ДатаЗаявки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Приоритет) ИЛИ НЕ ЗначениеЗаполнено(ДатаЗаявки) Тогда
		Возврат Неопределено;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаSLAСрезПоследних.СрокРеакцииЧасы КАК СрокРеакцииЧасы,
		|	ПравилаSLAСрезПоследних.СрокРешенияЧасы КАК СрокРешенияЧасы
		|ИЗ
		|	РегистрСведений.ПравилаSLA.СрезПоследних(&ДатаЗаявки, Приоритет = &Приоритет) КАК ПравилаSLAСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаЗаявки", ДатаЗаявки);
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура; 
	СтруктураРезультата.Вставить("СрокРеакцииЧасы", Выборка.СрокРеакцииЧасы);
	СтруктураРезультата.Вставить("СрокРешенияЧасы", Выборка.СрокРешенияЧасы);
	Возврат СтруктураРезультата;

КонецФункции  

Функция ПолучитьИсториюЗаявки(Заявка) Экспорт   
	ИсторияЗаявки = Новый Массив;
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Возврат ИсторияЗаявки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
		 "ВЫБРАТЬ
		 |	ИсторияИзмененияСтатусов.Период КАК ДатаИзменения,
		 |	ИсторияИзмененияСтатусов.СтарыйСтатус КАК СтарыйСтатус,
		 |	ИсторияИзмененияСтатусов.НовыйСтатус КАК НовыйСтатус,
		 |	ИсторияИзмененияСтатусов.Пользователь КАК Пользователь,
		 |	ИсторияИзмененияСтатусов.Комментарий КАК Комментарий
		 |ИЗ
		 |	РегистрСведений.ИсторияИзмененияСтатусов КАК ИсторияИзмененияСтатусов
		 |ГДЕ
		 |	ИсторияИзмененияСтатусов.Заявка = &Заявка
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	ДатаИзменения ВОЗР"; 
		 
    Запрос.УстановитьПараметр("Заявка", Заявка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПереходСтатуса = Новый Структура;
		ПереходСтатуса.Вставить("ДатаИзменения", Выборка.ДатаИзменения);
		ПереходСтатуса.Вставить("СтарыйСтатус", Выборка.СтарыйСтатус);
		ПереходСтатуса.Вставить("НовыйСтатус", Выборка.НовыйСтатус);
		ПереходСтатуса.Вставить("Пользователь", Выборка.Пользователь);
		ПереходСтатуса.Вставить("Комментарий", Выборка.Комментарий);
		ИсторияЗаявки.Добавить(ПереходСтатуса);	
	КонецЦикла;
	Возврат ИсторияЗаявки;
	
КонецФункции

Процедура ПроверитьНарушенияSLA() Экспорт
	МоментПроверки = ТекущаяДатаСеанса();
    ПустаяДата = Дата(1, 1, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ITЗаявка.Ссылка КАК Заявка,
		|	ITЗаявка.СрокРеакции КАК СрокРеакции,
		|	ITЗаявка.СрокРешения КАК СрокРешения,
		|	ITЗаявка.ДатаРеакции КАК ДатаРеакции,
		|	ITЗаявка.ДатаРешения КАК ДатаРешения
		|ИЗ
		|	Документ.ITЗаявка КАК ITЗаявка
		|ГДЕ
		|	ITЗаявка.ПометкаУдаления = ЛОЖЬ
		|	И (ITЗаявка.ДатаРеакции = &ПустаяДата
		|				И ITЗаявка.СрокРеакции <> &ПустаяДата
		|				И ITЗаявка.СрокРеакции < &МоментПроверки
		|			ИЛИ ITЗаявка.ДатаРешения = &ПустаяДата
		|				И ITЗаявка.СрокРешения <> &ПустаяДата
		|				И ITЗаявка.СрокРешения < &МоментПроверки)
		|	И ITЗаявка.ТекущийСтатус <> &Закрыта
		|	И ITЗаявка.ТекущийСтатус <> &Отменена";
	
	Запрос.УстановитьПараметр("МоментПроверки", МоментПроверки);
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	Запрос.УстановитьПараметр("Закрыта", Перечисления.СтатусыЗаявок.Закрыта);
	Запрос.УстановитьПараметр("Отменена", Перечисления.СтатусыЗаявок.Отменена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ДатаРеакции = ПустаяДата
			И Выборка.СрокРеакции <> ПустаяДата
			И Выборка.СрокРеакции < МоментПроверки Тогда

			НарушениеЗаписано = ЗаписатьНарушениеSLA(Выборка.Заявка, Перечисления.ТипыНарушенийSLA.НарушениеСрокаРеакции, Выборка.СрокРеакции);
			
			Если НЕ НарушениеЗаписано Тогда
				Сообщить("Не удалось зарегистрировать нарушение срока реакции по заявке " + Строка(Выборка.Заявка) + ".");
			КонецЕсли;
		КонецЕсли;

		Если Выборка.ДатаРешения = ПустаяДата
			И Выборка.СрокРешения <> ПустаяДата
			И Выборка.СрокРешения < МоментПроверки Тогда

			НарушениеЗаписано = ЗаписатьНарушениеSLA(Выборка.Заявка, Перечисления.ТипыНарушенийSLA.НарушениеСрокаРешения, Выборка.СрокРешения);
			
			Если НЕ НарушениеЗаписано Тогда
				Сообщить("Не удалось зарегистрировать нарушение срока решения по заявке " + Строка(Выборка.Заявка) + ".");
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	

КонецПроцедуры 

Функция ЗаписатьНарушениеSLA(Заявка, ТипНарушения, ДатаНарушения) Экспорт
	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не заполнена заявка.");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипНарушения) Тогда
		Сообщить("Не заполнен тип нарушения.");
		Возврат Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДатаНарушения) Тогда
		Сообщить("Не заполнена дата нарушения.");
		Возврат Ложь;
	КонецЕсли; 
	
    Попытка
		ЗаписьНарушения = РегистрыСведений.НарушенияSLA.СоздатьМенеджерЗаписи();
		ЗаписьНарушения.Заявка = Заявка;
		ЗаписьНарушения.ТипНарушения = ТипНарушения;
		ЗаписьНарушения.Прочитать();
		
		Если ЗаписьНарушения.Выбран() Тогда
			Возврат Истина;
		КонецЕсли;
 
		ЗаписьНарушения = РегистрыСведений.НарушенияSLA.СоздатьМенеджерЗаписи();

		ЗаписьНарушения.Заявка = Заявка;
		ЗаписьНарушения.ТипНарушения = ТипНарушения;
		ЗаписьНарушения.ДатаНарушения = ДатаНарушения;
		ЗаписьНарушения.Обработано = Ложь;

		ЗаписьНарушения.Записать();

		Возврат Истина;
		
	Исключение
		Сообщить("Не удалось записать нарушение SLA заявки " + Строка(Заявка) + ". " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ОбработатьНарушенияSLA(Заявка, ДатаРеакции, ДатаРешения, ТекущийСтатус, МоментОбработки) Экспорт
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
	Сообщить("Не указана заявка.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТекущийСтатус) Тогда
		Сообщить("Не указан статус заявки.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(МоментОбработки) Тогда
		Сообщить("Не указан момент обработки нарушений SLA.");
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НарушенияSLA.ТипНарушения КАК ТипНарушения
			|ИЗ
			|	РегистрСведений.НарушенияSLA КАК НарушенияSLA
			|ГДЕ
			|	НарушенияSLA.Обработано = ЛОЖЬ
			|	И НарушенияSLA.Заявка = &Заявка";
		
		Запрос.УстановитьПараметр("Заявка", Заявка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НужноОбработать = Ложь;
			КомментарийОбработки = "";
			ТипУведомления = Перечисления.ТипыУведомлений.ПустаяСсылка();
			
			Если ТекущийСтатус = Перечисления.СтатусыЗаявок.Отменена Тогда
				НужноОбработать = Истина;
				КомментарийОбработки = "Заявка отменена.";

			ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.Закрыта Тогда
				НужноОбработать = Истина;
				КомментарийОбработки = "Заявка закрыта.";

			ИначеЕсли Выборка.ТипНарушения =
				Перечисления.ТипыНарушенийSLA.НарушениеСрокаРеакции
				И ЗначениеЗаполнено(ДатаРеакции) Тогда

				НужноОбработать = Истина;
				КомментарийОбработки = "Реакция по заявке зафиксирована.";

			ИначеЕсли Выборка.ТипНарушения =
				Перечисления.ТипыНарушенийSLA.НарушениеСрокаРешения
				И ЗначениеЗаполнено(ДатаРешения) Тогда

				НужноОбработать = Истина;
				КомментарийОбработки = "Решение по заявке зафиксировано.";

			КонецЕсли;   
			
			Если НЕ НужноОбработать Тогда
				Продолжить;
			КонецЕсли;
			
			Если Выборка.ТипНарушения = Перечисления.ТипыНарушенийSLA.НарушениеСрокаРеакции Тогда
				ТипУведомления = Перечисления.ТипыУведомлений.НарушениеСрокаРеакции;

			ИначеЕсли Выборка.ТипНарушения = Перечисления.ТипыНарушенийSLA.НарушениеСрокаРешения Тогда
				ТипУведомления = Перечисления.ТипыУведомлений.НарушениеСрокаРешения;

			Иначе
				ВызватьИсключение
					"Неизвестный тип нарушения SLA.";
			КонецЕсли; 
			
			ЗаписьНарушения = РегистрыСведений.НарушенияSLA.СоздатьМенеджерЗаписи();
			ЗаписьНарушения.Заявка = Заявка;
			ЗаписьНарушения.ТипНарушения = Выборка.ТипНарушения;
			ЗаписьНарушения.Прочитать();
			
			Если НЕ ЗаписьНарушения.Выбран() Тогда
				ВызватьИсключение
					"Не удалось получить запись нарушения SLA.";
			КонецЕсли;

			ЗаписьНарушения.Обработано = Истина;
			ЗаписьНарушения.ДатаОбработки = МоментОбработки;
			ЗаписьНарушения.Комментарий = КомментарийОбработки;
			ЗаписьНарушения.Записать();	
			
			УведомленияОбработаны = УправлениеУведомлениямиСервер.ОтметитьУведомленияОбработанными(Заявка, ТипУведомления, МоментОбработки);

			Если НЕ УведомленияОбработаны Тогда
				ВызватьИсключение
					"Не удалось обработать уведомления о нарушении SLA.";
			КонецЕсли;	
		КонецЦикла;  
		
		
        ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию(); 
		Сообщить("Не удалось обработать нарушения SLA по заявке " + Строка(Заявка) + ". " + ОписаниеОшибки());
		Возврат Ложь;	
	КонецПопытки;
	
	Возврат Истина;
КонецФункции
